<a href="https://colab.research.google.com/github/aliyaaliyal/Tugas-Belajar-Python/blob/main/PySpark_SQL_Dataframe_basic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!apt-get install openjdk-8-jdk-headless -qq > /dev/null #instalasi openjdk
!wget -q http://archive.apache.org/dist/spark/spark-3.1.1/spark-3.1.1-bin-hadoop3.2.tgz #mengunduh spark dan hadoop
!tar xf spark-3.1.1-bin-hadoop3.2.tgz #ekstrak file hadoop dan spark
!pip install -q findspark #instalasi findspark

In [2]:
import os
os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-8-openjdk-amd64"
os.environ["SPARK_HOME"] = "/content/spark-3.1.1-bin-hadoop3.2"

In [3]:
import findspark 
findspark.init() #inisialisasi findspark
from pyspark.sql import SparkSession #mengimport sparksession
spark = SparkSession.builder.master("local[*]").getOrCreate() #jika sudah ada dapatkan session, jika blm ada buat session baru
spark.conf.set("spark.sql.repl.eagerEval.enabled", True) # Properti yang digunakan untuk memformat tabel keluaran lebih baik
spark #memanggil spark

In [6]:
# Muat csv ke dalam dataframe
titanic_df = spark.read.csv("/content/spark-3.1.1-bin-hadoop3.2/train.csv", header=True, inferSchema=True)
titanic_df

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| null|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|          382652| 29.125| null|       Q|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|   13.0| null|       S|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|            2649|  7.225| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [7]:
titanic_df.printSchema() #melihat skema dataframe

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [9]:
titanic_df.limit(7) #m3mbatasi tampilan sebanyak 7 baris

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+

In [10]:
titanic_df.select('PassengerId', 'Survived').limit(5) #menampilkan kolom passengerId dan survived serta membatasi tampilan sebanyak 5baris

+-----------+--------+
|PassengerId|Survived|
+-----------+--------+
|          1|       0|
|          2|       1|
|          3|       1|
|          4|       1|
|          5|       0|
+-----------+--------+

In [11]:
titanic_df.where((titanic_df.Age > 25) & (titanic_df.Survived == 1)).limit(5) 
#menampilkan semua data yg umur lebih dari 25 dan servived=1

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+

In [12]:
titanic_df.agg({'Fare':'avg'}) #agregate kolom fare bertipe rata2

+----------------+
|       avg(Fare)|
+----------------+
|32.2042079685746|
+----------------+

In [13]:
titanic_df.groupBy('Pclass').agg({'Fare':'avg'}).orderBy('Pclass', ascending=False)
#menampilkan rata2 kolom fare(tarif) berdasarkan group kolom pclass

+------+------------------+
|Pclass|         avg(Fare)|
+------+------------------+
|     3|13.675550101832997|
|     2| 20.66218315217391|
|     1| 84.15468749999992|
+------+------------------+

In [14]:
titanic_df.filter(titanic_df.Age > 25).agg({'Fare':'avg'}) #menampilkan rata2 tarif untuk usia diatas 25

+-----------------+
|        avg(Fare)|
+-----------------+
|37.61960169491524|
+-----------------+

In [16]:
from pyspark.sql.types import IntegerType
from pyspark.sql.functions import udf

def round_float_down(x):
  return int(x)

round_float_down_udf = udf(round_float_down, IntegerType())

titanic_df.select('PassengerId', 'Fare', round_float_down_udf('Fare').alias('pembulatan tarif')).limit(5)
#menampilkan kolom passengerid dan kolom fare serta membulatkan ke bawah kolom fare dan diberi nama kolom pembulatan tarif

+-----------+-------+----------------+
|PassengerId|   Fare|pembulatan tarif|
+-----------+-------+----------------+
|          1|   7.25|               7|
|          2|71.2833|              71|
|          3|  7.925|               7|
|          4|   53.1|              53|
|          5|   8.05|               8|
+-----------+-------+----------------+

In [17]:
titanic_df.createOrReplaceTempView("Titanic") #membuat view

In [18]:
spark.sql('select * from Titanic') #menampilkan semua kolom dari view titanic

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| null|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|          382652| 29.125| null|       Q|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|   13.0| null|       S|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|            2649|  7.225| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [20]:
spark.sql('select distinct(Pclass) from Titanic') #menampilkan data unik dari kolom pclass

+------+
|Pclass|
+------+
|     1|
|     3|
|     2|
+------+

In [23]:
spark.sql('select Name from Titanic where Sex="female"') #menampilkan nama penumpang yang jenis kelaminnya perempuan

+--------------------+
|                Name|
+--------------------+
|Cumings, Mrs. Joh...|
|Heikkinen, Miss. ...|
|Futrelle, Mrs. Ja...|
|Johnson, Mrs. Osc...|
|Nasser, Mrs. Nich...|
|Sandstrom, Miss. ...|
|Bonnell, Miss. El...|
|Vestrom, Miss. Hu...|
|Hewlett, Mrs. (Ma...|
|Vander Planke, Mr...|
|Masselmani, Mrs. ...|
|"McGowan, Miss. A...|
|Palsson, Miss. To...|
|Asplund, Mrs. Car...|
|"O'Dwyer, Miss. E...|
|Spencer, Mrs. Wil...|
|Glynn, Miss. Mary...|
|Vander Planke, Mi...|
|Nicola-Yarred, Mi...|
|Ahlin, Mrs. Johan...|
+--------------------+
only showing top 20 rows

In [24]:
spark.sql('select count(Name) from Titanic where Sex="female"') #menghitung total penumpang wanita

+-----------+
|count(Name)|
+-----------+
|        314|
+-----------+

In [25]:
spark.sql('select sum(fare) from Titanic where Pclass=3') #menampilkan total pemasukan penumpang kelas 3

+-----------------+
|        sum(fare)|
+-----------------+
|6714.695100000002|
+-----------------+

In [27]:
#menampilkan kolom kelas dan total pemasukan penumpang kelas 3
spark.sql('select Pclass, sum(fare) from Titanic where Pclass=3 group by Pclass ')

+------+-----------------+
|Pclass|        sum(fare)|
+------+-----------------+
|     3|6714.695100000002|
+------+-----------------+

In [29]:
#menampilkan kolom kelas dan total pemasukan penumpang kelas 3
spark.sql('select Pclass, sum(fare) as Total from Titanic where Pclass=3 group by Pclass ')

+------+-----------------+
|Pclass|            Total|
+------+-----------------+
|     3|6714.695100000002|
+------+-----------------+

In [30]:
spark.sql('select Pclass, sum(fare) as Total from Titanic group by Pclass') 
#menampilkan total pemasukan dari masing2 kelas

+------+------------------+
|Pclass|             Total|
+------+------------------+
|     1|18177.412499999984|
|     3| 6714.695100000002|
|     2|3801.8416999999995|
+------+------------------+

In [31]:
spark.sql('select max(PassengerId) from Titanic') #menampilkan passengerid paling besar

+----------------+
|max(PassengerId)|
+----------------+
|             891|
+----------------+

In [32]:
spark.sql('select distinct(Parch) from Titanic')

+-----+
|Parch|
+-----+
|    1|
|    6|
|    3|
|    5|
|    4|
|    2|
|    0|
+-----+

In [33]:
spark.sql('select distinct(SibSp) from Titanic')

+-----+
|SibSp|
+-----+
|    1|
|    3|
|    5|
|    4|
|    8|
|    2|
|    0|
+-----+

In [38]:
spark.sql('select Name, Parch, SibSp from Titanic where SibSp=4 and Parch=2')

+--------------------+-----+-----+
|                Name|Parch|SibSp|
+--------------------+-----+-----+
|Andersson, Miss. ...|    2|    4|
|Andersson, Miss. ...|    2|    4|
|Asplund, Master. ...|    2|    4|
|Asplund, Miss. Li...|    2|    4|
|Asplund, Master. ...|    2|    4|
|Andersson, Miss. ...|    2|    4|
|Andersson, Miss. ...|    2|    4|
|Andersson, Miss. ...|    2|    4|
|Andersson, Master...|    2|    4|
+--------------------+-----+-----+

In [39]:
spark.sql('select Name from Titanic where Name like"%Andersson%"') #menampilkan nama yg mengandung "Andersson"

+--------------------+
|                Name|
+--------------------+
|Andersson, Mr. An...|
|Andersson, Miss. ...|
|Andersson, Miss. ...|
|"Andersson, Mr. A...|
|Andersson, Miss. ...|
|Andersson, Miss. ...|
|Andersson, Mrs. A...|
|Andersson, Miss. ...|
|Andersson, Master...|
+--------------------+

In [40]:
spark.sql('select Name from Titanic where Name like"%Andersson%" and Survived=1')
#menampilkan nama yg mengandung "andersson" dan status selamat

+--------------------+
|                Name|
+--------------------+
|Andersson, Miss. ...|
|"Andersson, Mr. A...|
+--------------------+

In [42]:
spark.sql('select count(Name) from Titanic where Name like"%Andersson%" and Survived=1') 
#menampilkan berapa jumlah anggota keluarga andersson yg selamat

+-----------+
|count(Name)|
+-----------+
|          2|
+-----------+

In [45]:
spark.sql('select count(Name) from Titanic where Name like"%Andersson%" and Survived=1 and Sex="female"') 
##menampilkan berapa jumlah anggota keluarga andersson yg selamat dan berjenis kelamin perempuan

+-----------+
|count(Name)|
+-----------+
|          1|
+-----------+

In [49]:
spark.sql('select Name, Sex from Titanic where (Name like"%Andersson%" or Name like "%Asplund%") and Sex="female"')
#menampilkan keluarga andersson dan asplund yg berjenis kelmain perempuan

+--------------------+------+
|                Name|   Sex|
+--------------------+------+
|Asplund, Mrs. Car...|female|
|Andersson, Miss. ...|female|
|Andersson, Miss. ...|female|
|Asplund, Miss. Li...|female|
|Andersson, Miss. ...|female|
|Andersson, Miss. ...|female|
|Andersson, Mrs. A...|female|
|Andersson, Miss. ...|female|
+--------------------+------+

In [50]:
spark.sql('select * from Titanic where Cabin <> "Null"') 
#menampilkan semua data dimana kabin tidak sama dengan null

+-----------+--------+------+--------------------+------+----+-----+-----+-----------+--------+-----------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|     Ticket|    Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+-----------+--------+-----------+--------+
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|   PC 17599| 71.2833|        C85|       C|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|     113803|    53.1|       C123|       S|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|      17463| 51.8625|        E46|       S|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|    PP 9549|    16.7|         G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|     113783|   26.55|       C103|       S|
|         22|       1|     2|Beesley, Mr. Lawr...|  male|34.0|    0|    0|     248698|    13.0|        D56|       S|
|         24|       1|     1|Sloper, Mr. Willi...|  male|28.0|    0|    0|     113788|    35.5|         A6|       S|
|         28|       0|     1|Fortune, Mr. Char...|  male|19.0|    3|    2|      19950|   263.0|C23 C25 C27|       S|
|         32|       1|     1|Spencer, Mrs. Wil...|female|null|    1|    0|   PC 17569|146.5208|        B78|       C|
|         53|       1|     1|Harper, Mrs. Henr...|female|49.0|    1|    0|   PC 17572| 76.7292|        D33|       C|
|         55|       0|     1|Ostby, Mr. Engelh...|  male|65.0|    0|    1|     113509| 61.9792|        B30|       C|
|         56|       1|     1|   Woolner, Mr. Hugh|  male|null|    0|    0|      19947|    35.5|        C52|       S|
|         62|       1|     1| Icard, Miss. Amelie|female|38.0|    0|    0|     113572|    80.0|        B28|    null|
|         63|       0|     1|Harris, Mr. Henry...|  male|45.0|    1|    0|      36973|  83.475|        C83|       S|
|         67|       1|     2|Nye, Mrs. (Elizab...|female|29.0|    0|    0| C.A. 29395|    10.5|        F33|       S|
|         76|       0|     3|Moen, Mr. Sigurd ...|  male|25.0|    0|    0|     348123|    7.65|      F G73|       S|
|         89|       1|     1|Fortune, Miss. Ma...|female|23.0|    3|    2|      19950|   263.0|C23 C25 C27|       S|
|         93|       0|     1|Chaffee, Mr. Herb...|  male|46.0|    1|    0|W.E.P. 5734|  61.175|        E31|       S|
|         97|       0|     1|Goldschmidt, Mr. ...|  male|71.0|    0|    0|   PC 17754| 34.6542|         A5|       C|
|         98|       1|     1|Greenfield, Mr. W...|  male|23.0|    0|    1|   PC 17759| 63.3583|    D10 D12|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+-----------+--------+-----------+--------+
only showing top 20 rows

In [51]:
#menampilkan jumlah penumpang yang ada disemua cabin
spark.sql(' select count(Name) from Titanic where Cabin <> "Null"')

+-----------+
|count(Name)|
+-----------+
|        204|
+-----------+

In [52]:
spark.sql(' select count(Name) from Titanic where Cabin <> "Null" and Survived=1') 
#menampilkan jumlah penumpang yg selamat dan ada di dalam cabin

+-----------+
|count(Name)|
+-----------+
|        136|
+-----------+